{"hed":"Hed","dek":"Subhed","author":"Jordan Dworkin","authorURL1":"https://twitter.com/jddwor","intro":[{"type":"text","value":"Arms spread and a smile on his face, Elon Musk welcomed the crowd to the <a href=https://www.theverge.com/2017/11/17/16669142/tesla-semi-roadster-2017-supercut-watch target = _blank>Tesla semi truck unveiling</a>. “I hope you like what you see,” he said, to cheers from the audience. Though innovations like Tesla’s promise increased <a href=https://techcrunch.com/2017/11/16/this-is-teslas-big-new-all-electric-truck-the-tesla-semi/ target=_blank>safety and efficiency</a> for the industries they inhabit, these advances in automation and AI promise <a href=https://www.wired.com/story/what-does-teslas-truck-mean-for-truckers/ target=_blank>uncertainty</a>, and potential displacement, for the workers in their way."},{"type":"text","value":"While many are calling for the <a href=https://qz.com/1089261/americans-want-big-government-help-when-robots-and-artificial-intelligence-take-their-jobs/ target=_blank>government</a> to step in, in this piece we are going to focus on the workers themselves. Specifically, we want to ask how workers should train and be trained to most effectively switch jobs. In this context, discussions often focus on the somewhat drastic example of switching from blue-collar work to computer programming. While there are organizations doing great work to facilitate this switch, we wanted to use this example to ask: Is it really necessary for workers to move that far across the job landscape to avoid automation?"}],"twojobs":[{"id":"0","step":"all-automation","text":"Jobs with a high social component and a high number of non-routine tasks, like <span class=heavy-prose-blue-text>elementary school teachers</span>, are unlikely to become automated. Jobs with many monotonous tasks and a low requirement for complex social skills, like <span class=heavy-prose-red-text>telemarketers</span>, are likely to be replaced by machines."},{"id":"1","step":"main-job-circle","text":"The likelihood that <span class=heavy-prose-red-text>heavy truck drivers</span> will become automated is 79%."},{"id":"2","step":"main-job-automation","text":"For people whose jobs are at risk, the transition to <span class=heavy-prose-blue-text>software development</span> makes ostensible sense: it’s a job that’s highly unlikely to become automated, and affords a good income."},{"id":"3","step":"images-two-jobs-two-skills","text":"The Department of Labor site, which contains the importance of each skill to a particular job, notes that  Software developers excel at programming."},{"id":"4","step":"images-two-jobs-many-skills","text":"The Department of Labor site, which contains the importance of each skill to a particular job, notes that  Software developers excel at programming."},{"id":"5","step":"images-two-jobs-stacked-skills","text":"Here’s how different they are. Still, that doesn’t tell us much — it makes little sense to compare these two professions in a vacuum, since all professions are going to be different to some degree. To truly get a sense of how similar developers are to truckers, let’s include the similarity scores of some other professions."},{"id":"6","step":"images-many-jobs-many-skills","text":"Here’s how different they are. Still, that doesn’t tell us much — it makes little sense to compare these two professions in a vacuum, since all professions are going to be different to some degree. To truly get a sense of how similar developers are to truckers, let’s include the similarity scores of some other professions."}],"scatter":[{"id":"7","step":"x-axis-base","text":"We can place all the careers on the horizontal axis, from least similar in skill to most similar. Of nearly 700 jobs, psychologists are most distinct from truck drivers, while septic tank servicers and sewer pipe cleaners have the greatest skills overlap."},{"id":"8","step":"xy-axis-scatter","text":"Ideally, we would help truck drivers transition to jobs that are similar in skills, but that are less automatable. Let’s add the automatability dimension back in!"},{"id":"9","step":"xy-axes-scatter","text":"Since we’re looking for less automatable job alternatives to truckers, let’s remove all the careers that have a higher chance of becoming automated — that is to say, all the ones with a 79% of higher likelihood of automation."},{"id":"10","step":"xy-axes-scatter-filtered","text":"We’re most interested in the top right corner: jobs that have a low automatability likelihood, and high similarity to truckers in terms of the skills required to perform them. In this case, ambulance drivers seem like a viable alternative. We should, however, consider the salaries that these professions will earn — truck drivers earn around $42,000 a year, so any job that a trucker would transition to would have to have a similar income. Let’s add that variable in: jobs in red would earn less, and jobs in blue would earn more."},{"id":"11","step":"show-similarity-auto-wage","text":"Most jobs, especially those that have a low automatability and a high skill similarity, have a much lower income. Only ambulance drivers seem to be a rock solid transitional career. We should, however, consider one final job characteristic: the number of these jobs that will likely be available 10 years from now. If there are nearly 2 million truckers in America today, which occupations will have enough openings for the large number of truck drivers to comfortably make the transition? Let’s add the number of projected jobs in 2026 to the scatterplot, with the number corresponding to circle radius."},{"id":"12","step":"show-similarity-auto-wage-number","text":"When we add job availability into the equation, there are even fewer jobs to consider. In fact, it’s clear that no single job can accommodate all the truck drivers. It’s likely that truck drivers would need to consider a number of career options, which include ambulance driving, piloting a ship, and electrical power-line repair and installation, when planning for their future. Policy makers, think tanks, philanthropic organizations, and non-profit initiatives should all consider this carefully when funding viable alternatives for job reskilling. Interested in how other jobs will far? Choose a career other than truck drivers below!"}],"all-automation":[{"type":"text","value":"Jobs with a high social component and a high number of non-routine tasks, like <span class=heavy-prose-blue-text>elementary school teachers</span>, are unlikely to become automated. Jobs with many monotonous tasks and a low requirement for complex social skills, like <span class=heavy-prose-red-text>telemarketers</span>, are likely to be replaced by machines."}],"main-job-circle":[{"type":"text","value":"The likelihood that <span class=heavy-prose-red-text>heavy truck drivers</span> will become automated is 79%."},{"type":"text","value":"Truckers are worth looking at in greater depth because there are nearly <span class=heavy-prose> 2 million</span> heavy truck drivers in the U.S. For many years, it’s allowed people without a college education to maintain a dependable, middle-class income; if trucking is no longer an option, many thousands of people will lose a stable and secure pathway to the middle class."}],"main-job-automation":[{"type":"text","value":"For people whose jobs are at risk, the transition to <span class=heavy-prose-blue-text>software development</span> makes ostensible sense: it’s a job that’s highly unlikely to become automated, and affords a good income."}],"two-jobs-automation":[{"type":"text","value":"The skills involved in these professions, however, are remarkably different."}],"main-job-example-skill":[{"type":"text","value":"The Department of Labor site, which contains the importance of each skill to a particular job, notes that <span class=heavy-prose-blue-text>software developers</span> excel at programming. <span class=heavy-prose-red-text>Truck drivers</span>, meanwhile, must have a high level of multi-limb coordination in order to successfully maneuver their rigs."}],"comparison-job-example-skill":[],"two-jobs-all-skills":[{"type":"text","value":"By looking at the differences between software developers and truck drivers across this range of skills, we can tell how far their expertise diverge"}],"two-jobs-skills-difference":[],"two-jobs-stack-difference":[{"type":"text","value":"Here’s how different they are. Still, that doesn’t tell us much — it makes little sense to compare these two professions in a vaccuum, since all professions are going to be different to some degree. To truly get a sense of how similar developers are to truckers, let’s include the similarity scores of some other professions."}],"many-jobs-stack-difference":[{"type":"text","value":"Of the above professions, ambulance drivers are most similar to truck drivers. CEOs, meanwhile, have the greatest difference between their skills, and those of truckers."}],"x-axis-scatter":[{"type":"text","value":"We can place all the careers on the horizontal axis, from least similar in skill to most similar. Ideally, we would help truck drivers transition to jobs that are similar in skills, but that are less automatable. Let’s add the automatability dimension back in!"}],"xy-axes-scatter":[{"type":"text","value":"We’re most interested in the top right corner: jobs that have a low automatability likelihood, and high similarity to truckers in terms of the skills required to perform them. In this case, ambulance drivers seem like a viable alternative. We should, however, consider the salaries that these professions will earn — truck drivers earn around $42,000 a year, so any job that a trucker would transition to would have to have a similar income. Let’s add that variable in: jobs in red would earn less, and jobs in blue would earn more."}],"show-similarity-auto-wage":[{"type":"text","value":"Most jobs, especially those that have a low automatability and a high skill similarity, have a much lower income. Only ambulance drivers seem to be a rock solid transitional career. We should, however, consider one final job characteristic: the number of these jobs that will likely be available 10 years from now. If there are nearly 2 million truckers in America today, which occupations will have enough openings for the large number of truck drivers to comfortably make the transition? Let’s add the number of projected jobs in 2026 to the scatterplot, with the number corresponding to circle radius."}],"show-similarity-auto-wage-number":[{"type":"text","value":"When we add job availability into the equation, there are even fewer jobs to consider. In fact, it’s clear that no single job can accommodate all the truck drivers. It’s likely that truck drivers would need to consider a number of career options, which include ambulance driving, piloting a ship, and electrical power-line repair and installation, when planning for their future. Policy makers, think tanks, philanthropic organizations, and non-profit initiatives should all consider this carefully when funding viable alternatives for job reskilling. Interested in how other jobs will far? Choose a career other than truck drivers below!"}]}